Tekla Open API Reference for Tekla Structures 2025
Boolean Constructor
 Initializes a new instance of the structure.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Boolean(
	bool boolValue
)
Public Sub New (
	boolValue As Boolean
)
Parameters
boolValue
Type: System.Boolean
The boolean value.
See Also
Reference
Boolean Structure
Tekla.Structures.Datatype Namespace